Repository: JMGS93/fit-league
Catalog: lib/l10n/app_*.arb
Languages: es

# dailyCalories
source: Calories: {calories}/day
es: Calorías: {calories}/día

# chooseWhatYouEat_question
source: Food?
es: ¿COMIDA?

# chooseWhatYouEat_answer
source: YOU CHOOSE
es: TÚ ELIJES

# dailyCalories_label
source: Calories:
es: Calorías:

# dailyCalories_value
source: {calories}/day
es: {calories}/día

# breakfastMeal
source: breakfast
es: desayuno

# lunchMeal
source: lunch
es: almuerzo

# snackMeal
source: snack
es: merienda

# dinnerMeal
source: dinner
es: cena

# createMealCardTitle
source: Create {meal}
es: Crear {meal}

# caloriesAssigned
source: {calorias} calories assigned
es: {calorias} calorías asignadas

# insufficientProgressData
source: Not enough data to calculate progress.
es: No hay datos suficientes para calcular el progreso.

# currentBodyFatIndex
source: Current Body Fat Index: {value}%
es: Índice Grasa Actual: {value}%

# ingredientJamonSerrano
source: Spanish Ham
es: Jamón Serrano

# ingredientJamonYork
source: York Ham
es: Jamón York

# ingredientFiambreDePavo
source: Turkey Cold Cuts
es: Fiambre de Pavo

# ingredientLomoEmbuchado
source: Cured Pork Loin
es: Lomo Embuchado

# ingredientHuevosAlaPlancha
source: Grilled Eggs
es: Huevos a la Plancha

# ingredientHuevosRevueltos
source: Scrambled Eggs
es: Huevos Revueltos

# ingredientHuevosCocidos
source: Boiled Eggs
es: Huevos Cocidos

# ingredientOmeletteDeClaras
source: Egg White Omelette
es: Omelette de Claras

# ingredientQuesoFresco
source: Fresh Cheese
es: Queso Fresco

# ingredientYogurGriego
source: Greek Yogurt
es: Yogur Griego

# ingredientKefir
source: Kefir
es: Kéfir

# ingredientQuesoCottage
source: Cottage Cheese
es: Queso Cottage

# ingredientQuesoEdam
source: Edam Cheese
es: Queso Edam

# ingredientSalmonAhumado
source: Smoked Salmon
es: Salmón Ahumado

# ingredientAtunEnLataNatural
source: Canned Tuna in Water
es: Atún en Lata en Agua

# ingredientCarnePicadaTernera
source: Minced Beef
es: Carne Picada Ternera

# ingredientSolomilloTernera
source: Beef Tenderloin
es: Solomillo de Ternera

# ingredientEntrecotTernera
source: Beef Ribeye
es: Entrecot de Ternera

# ingredientBistecTernera
source: Beef Steak
es: Bistec de Ternera

# ingredientHigadoTernera
source: Beef Liver
es: Hígado de Ternera

# ingredientMuslosPollo
source: Chicken Thighs
es: Muslos de Pollo

# ingredientPechugaPollo
source: Chicken Breast
es: Pechuga de Pollo

# ingredientCarnePavo
source: Turkey Meat
es: Carne de Pavo

# ingredientCabezaLomoCerdo
source: Pork Shoulder
es: Cabeza de Lomo de Cerdo

# ingredientSolomilloCerdo
source: Pork Tenderloin
es: Solomillo de Cerdo

# ingredientChuletasCerdo
source: Pork Chops
es: Chuletas de Cerdo

# ingredientLomoCerdo
source: Pork Loin
es: Lomo de Cerdo

# ingredientMozzarellaBufala
source: Buffalo Mozzarella
es: Mozzarella de Búfala

# ingredientGarbanzos
source: Chickpeas
es: Garbanzos

# ingredientSalmonFresco
source: Fresh Salmon
es: Salmón Fresco

# ingredientAtunFresco
source: Fresh Tuna
es: Atún Fresco

# ingredientMerluza
source: Hake
es: Merluza

# ingredientBacalao
source: Cod
es: Bacalao

# ingredientSardinas
source: Sardines
es: Sardinas

# ingredientCaballa
source: Mackerel
es: Caballa

# ingredientLubina
source: Sea Bass
es: Lubina

# ingredientDorada
source: Gilt-head Bream
es: Dorada

# ingredientCalamar
source: Squid
es: Calamar

# ingredientSepia
source: Cuttlefish
es: Sepia

# ingredientPulpo
source: Octopus
es: Pulpo

# ingredientMejillones
source: Mussels
es: Mejillones

# ingredientLangostinos
source: Prawns
es: Langostinos

# ingredientZumoDeNaranja
source: Orange Juice
es: Zumo de Naranja

# ingredientLecheEntera
source: Whole Milk
es: Leche Entera

# ingredientLecheSemidesnatada
source: Semi-skimmed Milk
es: Leche Semidesnatada

# ingredientLecheDesnatada
source: Skimmed Milk
es: Leche Desnatada

# ingredientLecheSinLactosa
source: Lactose-free Milk
es: Leche sin Lactosa

# ingredientBebidaDeAvena
source: Oat Drink
es: Bebida de Avena

# ingredientBebidaDeSoja
source: Soy Drink
es: Bebida de Soja

# ingredientBebidaDeArroz
source: Rice Drink
es: Bebida de Arroz

# ingredientProteinaPolvo
source: Protein Powder
es: Proteína en Polvo

# ingredientQuesoCrema
source: Cream Cheese
es: Queso Crema

# ingredientQuesoCremaLight
source: Light Cream Cheese
es: Queso Crema Light

# ingredientAvenaCruda
source: Oats
es: Avena

# ingredientPanDeMoldeIntegral
source: Whole Wheat Bread
es: Pan de Molde Integral

# ingredientPanDeMoldeBlanco
source: White Bread
es: Pan de Molde Blanco

# ingredientMargarina
source: Margarine
es: Margarina

# ingredientMantequilla
source: Butter
es: Mantequilla

# ingredientCremaDeCacahuete
source: Peanut Butter
es: Crema de Cacahuete

# ingredientMermeladaSinAzucar
source: Sugar-free Jam
es: Mermelada sin azúcar

# ingredientAguacate
source: Avocado
es: Aguacate

# ingredientTomate
source: Tomato
es: Tomate

# ingredientUvas
source: Grapes
es: Uvas

# ingredientMandarinas
source: Tangerines
es: Mandarinas

# ingredientManzana
source: Apple
es: Manzana

# ingredientFresas
source: Strawberries
es: Fresas

# ingredientFrambuesas
source: Raspberries
es: Frambuesas

# ingredientArandanos
source: Blueberries
es: Arándanos

# ingredientMoras
source: Blackberries
es: Moras

# ingredientSandia
source: Watermelon
es: Sandía

# ingredientMelon
source: Melon
es: Melón

# ingredientPina
source: Pineapple
es: Piña

# ingredientDatiles
source: Dates
es: Dátiles

# ingredientNueces
source: Walnuts
es: Nueces

# ingredientPistachos
source: Pistachios
es: Pistachos

# ingredientAlmendrasCrudas
source: Almonds (Not Fried/Toasted)
es: Almendras Sin Tostar

# ingredientAnacardos
source: Cashews
es: Anacardos

# ingredientPanDeHamburguesa
source: Burger Bun
es: Pan de Hamburguesa

# ingredientArrozBlancoCocido
source: White Rice
es: Arroz Blanco

# ingredientArrozBasmatiCocido
source: Basmati Rice
es: Arroz Basmati

# ingredientJudiasBlancasCocidas
source: White Beans
es: Judías Blancas

# ingredientFrijolesRojosCocidos
source: Red Beans
es: Frijoles Rojos

# ingredientGuisantes
source: Peas
es: Guisantes

# ingredientJudiasVerdes
source: Green Beans
es: Judías Verdes

# ingredientCol
source: Cabbage
es: Col

# ingredientBrocoli
source: Broccoli
es: Brócoli

# ingredientColiflor
source: Cauliflower
es: Coliflor

# ingredientEspinacas
source: Spinach
es: Espinacas

# ingredientCalabacin
source: Zucchini
es: Calabacín

# ingredientEsparragos
source: Asparagus
es: Espárragos

# ingredientBerenjena
source: Eggplant
es: Berenjena

# ingredientChampinones
source: Mushrooms
es: Champiñones

# ingredientParmesanoRallado
source: Grated Parmesan
es: Parmesano Rallado

# ingredientMozzarellaRallada
source: Grated Mozzarella
es: Mozzarella Rallada

# ingredientPatataCocida
source: Cooked Potato
es: Patata

# ingredientBoniatoCocido
source: Cooked Sweet Potato
es: Boniato

# ingredientYuca
source: Cassava
es: Yuca

# ingredientLentejasCocidas
source: Lentils
es: Lentejas

source: Create meal
es: Crear plato

# createMealTitle
source: Create {meal}
es: Crear {meal}

# customMealInfo
source: Max: {calories} calories. Choose ingredients and they will be adjusted automatically.
es: Max: {calories} calorías. Elije ingredientes y serán ajustados automáticamente.

# mainIngredientLabel
source: Main Ingredient
es: Ingrediente Principal

# mainIngredientInfo
source: Main ingredient = {percentage}% of the dish
es: Ingrediente principal = {percentage}% del plato

# sideDish1Label
source: Side Dish 1
es: Guarnición 1

# sideDish1Info
source: Side Dish 1 = {percentage}% of the dish
es: Guarnición 1 = {percentage}% del plato

# sideDish2Label
source: Side Dish 2
es: Guarnición 2

# sideDish2Info
source: Side Dish 2 = {percentage}% of the dish
es: Guarnición 2 = {percentage}% del plato

# generateDishButton
source: Generate Dish
es: Generar Plato

source: Your Dish
es: Tu Plato

# totalCalories
source: Total Calories: {calories} kcal
es: Calorías totales: {calories} kcal

# totalProteins
source: Total Proteins: {proteins} g
es: Proteínas totales: {proteins} g

# noProgressData
source: Not enough data to calculate progress.
es: No hay datos suficientes para calcular el progreso.

# currentFatIndex
source: Current Body Fat Index: {value}%
es: Índice Grasa Actual: {value}%

# dynamicDishCalculatorInputLabel
source: Enter desired calories
es: Introduce las calorías deseadas

# dynamicDishCalculatorButton
source: Generate Dish
es: Generar Plato

# sideDish3Label
source: Side Dish 3
es: Guarnición 3

# dynamicDishCalculatorInfoTitle
source: Dynamic Dish Calculator Information
es: Información sobre la Calculadora Dinámica

# dynamicDishCalculatorPlateCalories
source: Choose the calories for your dish
es: Elige las calorías para tu plato

# dynamicDishCalculatorTotalPercentage
source: Total: {percentage}%{exceeding, select, true { - Exceeds 100%} other {}}
es: Total: {percentage}%{exceeding, select, true { - Excede el 100%} other {}}

# dynamicDishCalculatorInfoMessage
source: Welcome to the Dynamic Dish Calculator. This tool allows you to create custom dishes by adjusting the calorie distribution according to your preferences. You can select a main ingredient and up to three side dishes, and adjust the percentage of calories assigned to each. Use it as an additional resource if you follow other diets beyond Fit League. Explore the possibilities and create your ideal dishes!
es: Bienvenido a la Calculadora Dinámica de Platos. Esta herramienta te permite generar platos personalizados eligiendo las calorias totales del plato sin límite, ajustando la distribución de calorías según tus preferencias, seleccionar el ingrediente principal y hasta tres guarniciones, y ajustar el porcentaje de calorías asignado a cada uno. Utilízala como herramienta adicional en el caso de que tengas otro tipo de dieta con mayor aporte calórico. ¡Explora las posibilidades y crea tus platos ideales!

# dynamicDishCalculatorInfoDontShowAgain
source: Don't show this message again
es: No volver a mostrar este mensaje

# dynamicDishCalculatorTitle
source: Dynamic Dish Calculator
es: Calculadora

# adjustPercentageLabel
source: Adjust the percentage for each ingredient
es: Ajusta el porcentaje para cada ingrediente

source: Password
es: Contraseña

source: Cancel
es: Cancelar

source: Confirm
es: Confirmar

# menuDynamicDishCalculator
source: Dynamic Dish Calculator
es: Calculadora Dinámica de Platos

# categoriaHuevos
source: Eggs (RAW WEIGHT)
es: Huevos (PESAR CRUDO)

# categoriaPasta
source: Pasta (RAW WEIGHT)
es: Pasta (PESAR CRUDO)

# categoriaQueso
source: Cheese
es: Queso

# categoriaCerdo
source: Pork (RAW WEIGHT)
es: Cerdo (PESAR CRUDO)

# categoriaTernera
source: Beef (RAW WEIGHT)
es: Ternera (PESAR CRUDO)

# categoriaPollo
source: Chicken (RAW WEIGHT)
es: Pollo (PESAR CRUDO)

# categoriaPavo
source: Turkey (RAW WEIGHT)
es: Pavo (PESAR CRUDO)

# categoriaVegetariano
source: Vegetarian
es: Vegetariano

# categoriaMarisco
source: Seafood (RAW WEIGHT)
es: Marisco (PESAR CRUDO)

# categoriaVerdura
source: Vegetable (RAW WEIGHT)
es: Verdura (PESAR CRUDO)

# categoriaFruta
source: Fruit
es: Fruta

# categoriaLacteo
source: Dairy
es: Lácteo

# categoriaPescado
source: Fish (RAW WEIGHT)
es: Pescado (PESAR CRUDO)

# categoriaConservas
source: Canned Foods
es: Conservas

# categoriaLegumbres
source: Legumes (COOKED WEIGHT)
es: Legumbres (PESAR COCIDO)

# categoriaBebidas
source: Beverages
es: Bebidas

# categoriaCereales
source: Cereals
es: Cereales

# categoriaSecos
source: Nuts
es: Frutos Secos

# categoriaBayas
source: Berries
es: Bayas

# categoriaOtros
source: Others
es: Otros

# chooseWhatYouEat
source: ¿FOOD? YOU CHOOSE
es: ¿COMIDA? TÚ ELIJES

# changeDeficitQuestion
source: Do you want to change your caloric deficit?
es: ¿Quieres cambiar tu déficit calórico?

# yesButton
source: Yes
es: Sí

# infoChangeDeficit
source: You can change deficit by tapping 'settings'
es: Puedes cambiar tu déficit pulsando 'ajustes'

# targetReached
source: Target reached! You've achieved the ideal body fat level. Keep up your healthy habits to continue improving your wellbeing.
es: ¡Objetivo alcanzado! Has alcanzado el nivel ideal de grasa corporal. Sigue manteniendo tus hábitos saludables para continuar mejorando tu bienestar.

# updateError
source: Error updating data. Please try again.
es: Error al actualizar los datos. Por favor, inténtalo de nuevo.

# privacyPolicyTitle
source: Privacy Policy
es: Política de Privacidad

# privacyPolicyContent
source: Last updated: 05/07/2025\n\n1. Introduction\nFit League is committed to protecting the privacy and security of our users’ personal data. This Privacy Policy explains in detail how we collect, use, store, and safeguard the information you provide through our app. By using our services, you agree to the terms outlined here.\n\n2. Information We Collect\nTo provide a personalized experience and optimize our app’s functionality, we collect the following data:\n- Email Address: Used to identify your account and manage communications.\n- Total Calories: Numeric record of the total calories logged during tracking.\n- Caloric Deficit: Numeric value indicating the user’s configured calorie deficit.\n- Total Days: Number of days recorded in tracking, stored as a string.\n- Gender: User’s gender information.\n- Body Fat Percentage: Current body fat percentage based on user inputs.\n- Initial Body Fat: Initial body fat percentage used as a reference.\n- Fat Mass: Numeric value representing the user’s fat mass.\n- Muscle Mass: Numeric record of current muscle mass.\n- Weight to Lose: Numeric target weight to lose.\n- Result Text: A string presenting the personalized calculation results, e.g., “Your body fat percentage is 25.10%.”\n- Saved Meals: Data for each custom meal the user chooses to save, including the recipe name, list of ingredients, and quantities.\n\n3. How We Use the Information\nWe use the collected information to:\n- Personalize and improve your experience.\n- Provide and maintain app features.\n- Generate and display customized results based on your data.\n- Communicate updates, service changes, and relevant notifications.\n- Comply with legal and security obligations.\n\n4. Storage and Security\nAll data is stored on secure platforms such as Google Cloud Firestore. We implement strict technical and organizational measures to protect your information against unauthorized access, alteration, or disclosure. Access is restricted to authenticated users only.\n\n5. Information Sharing\nWe do not share your personal data with third parties, except in the following cases:\n- When required by law or competent authorities.\n- With service providers who assist in app delivery and maintenance, under confidentiality agreements ensuring data security.\n\n6. Your Rights\nYou have the right to access, correct, or delete your personal data; limit its processing; request data portability; and withdraw consent at any time. To exercise these rights, contact us at fl_team@hotmail.com.\n\n7. Policy Changes\nWe reserve the right to modify or update this Privacy Policy at any time. Changes will be posted here and the “Last updated” date will be revised. Please review periodically to stay informed.\n\n8. International Transfers\nIf your data is transferred or stored outside the European Economic Area, we apply appropriate safeguards such as EU standard contractual clauses or recognized certifications to ensure secure handling.\n\n9. Data Retention\nWe retain personal data only as long as necessary to fulfill the purposes for which it was collected or as required by law. Once no longer needed, data will be securely deleted or anonymized.\n\n10. Data Breach Notification\nIn the event of a security breach affecting your personal data, we will notify affected users immediately and detail the measures taken to mitigate any impact. To report a breach, contact fl_team@hotmail.com.\n\n11. Advertising & Third Parties\nOur app uses third-party ad services (e.g., Google Mobile Ads), which may collect non-personal identifiers like device IDs and usage data to optimize and personalize ads. Collected data is used solely to deliver relevant ads and improve our services, in accordance with providers’ privacy policies. You can manage ad personalization in your device settings.\n\n12. Contact\nFor any questions, concerns, or requests regarding this Privacy Policy or your personal data, please contact us at fl_team@hotmail.com.\n\n13. Billing Data\nTo process and manage subscriptions, we collect transaction IDs, purchase/renewal dates, and the email address associated with your Google Play or App Store account. This information is stored securely and used only to verify subscription status, manage auto-renewals, and handle refund requests.\n\n14. Renewals & Cancellations\nSubscriptions automatically renew at the end of each period (monthly or annual). You may cancel auto-renewal anytime via Google Play (Android) or the App Store (iOS). Upon cancellation, you retain access until the end of the paid period.
es: Última actualización: [07/05/2025] 1. Introducción En Fit League estamos comprometidos con la protección de la privacidad y la seguridad de los datos personales de nuestros usuarios. La presente Política de Privacidad describe de forma detallada cómo recopilamos, utilizamos, almacenamos y protegemos la información que usted nos proporciona a través de nuestra aplicación. Al utilizar nuestros servicios, usted acepta los términos y condiciones aquí expuestos. 2. Información que Recopilamos Con el fin de ofrecerle una experiencia personalizada y optimizar el funcionamiento de nuestra aplicación, recopilamos la siguiente información: - Correo Electrónico: Dirección de correo electrónico utilizada para la identificación de la cuenta y la gestión de las comunicaciones. - Calorías Totales: Registro numérico del total de calorías acumuladas durante el seguimiento. - Déficit Calórico: Valor numérico que indica el déficit calórico configurado por el usuario. - Días Totales: Número total de días registrados en el seguimiento, almacenado en formato de cadena. - Género: Información referente al género del usuario. - Grasa Corporal: Porcentaje actual de grasa corporal obtenido a partir de los datos ingresados. - Grasa Corporal Inicial: Porcentaje inicial de grasa corporal utilizado como referencia para los cálculos. - Masa de Grasa: Valor numérico que representa la cantidad de masa grasa del usuario. - Masa Muscular: Registro numérico que indica la masa muscular actual. - Peso a Eliminar: Valor numérico que define el peso objetivo a eliminar. - Resultado: Cadena de texto que presenta el resultado del cálculo personalizado, por ejemplo: “Tu porcentaje de grasa corporal es 25.10%.” - Platos Guardados: Datos de cada comida personalizada que el usuario elige guardar, incluyendo nombre de la receta, lista de ingredientes y cantidades. 3. Uso de la Información La información recopilada se utiliza para: - Personalizar y mejorar la experiencia del usuario. - Proveer y mantener las funcionalidades de la aplicación. - Generar y mostrar resultados personalizados basados en los datos ingresados. - Comunicarse con el usuario respecto a actualizaciones, cambios en el servicio y notificaciones relevantes. - Cumplir con obligaciones legales y de seguridad. 4. Almacenamiento y Seguridad Los datos recopilados se almacenan en plataformas seguras, como Google Cloud Firestore. Hemos implementado estrictas medidas de seguridad técnicas y organizativas para proteger su información contra accesos no autorizados, alteraciones o divulgaciones indebidas. El acceso a estos datos está restringido únicamente a usuarios autenticados. 5. Compartición de la Información No compartimos su información personal con terceros, salvo en las siguientes circunstancias: - Cuando sea requerido por la ley o por autoridades competentes. - Con proveedores de servicios que colaboren en la prestación y mantenimiento de nuestra aplicación, siempre bajo acuerdos que aseguren la confidencialidad y seguridad de sus datos. 6. Derechos del Usuario Usted tiene derecho a acceder a los datos personales que tenemos sobre usted; a solicitar la rectificación de datos inexactos o incompletos; a exigir la supresión de sus datos; a limitar el tratamiento de los mismos; a la portabilidad de los datos; y a oponerse al tratamiento o retirar su consentimiento en cualquier momento. Para ejercer estos derechos, contáctenos a través de fl_team@hotmail.com. 7. Cambios en esta Política Nos reservamos el derecho de modificar o actualizar esta Política de Privacidad en cualquier momento. Los cambios serán publicados en este documento y se actualizará la “Última actualización”. Se recomienda revisar periódicamente esta política para estar informado sobre cualquier modificación. 8. Transferencias Internacionales Si sus datos son transferidos o almacenados fuera del Espacio Económico Europeo, adoptamos las medidas de seguridad adecuadas, tales como el uso de cláusulas contractuales tipo aprobadas por la Comisión Europea o certificaciones reconocidas, para garantizar que sus datos se traten de forma segura. 9. Plazo de Conservación Conservamos sus datos personales solo durante el tiempo estrictamente necesario para cumplir con la finalidad para la que fueron recabados o según lo exija la ley. Una vez que los datos ya no sean necesarios, se procederá a su eliminación o anonimización de forma segura. 10. Procedimiento de Notificación en Caso de Brecha de Datos En caso de una brecha de seguridad que comprometa la integridad de sus datos personales, notificaremos a los usuarios afectados de manera inmediata e informaremos detalladamente sobre las medidas adoptadas para mitigar sus efectos. Para más información o para reportar una brecha, contáctenos a fl_team@hotmail.com. 11. Publicidad y Terceros Nuestra aplicación utiliza servicios de terceros para la difusión de publicidad (por ejemplo, Google Mobile Ads), los cuales pueden recopilar información no identificable personalmente, como identificadores de dispositivo y datos de uso, para optimizar y personalizar la experiencia publicitaria. Los datos recolectados se utilizan exclusivamente para ofrecer anuncios relevantes y mejorar nuestros servicios, gestionándose conforme a las políticas de privacidad de dichos proveedores. Usted puede gestionar la personalización de anuncios a través de la configuración de su dispositivo. 12. Contacto Si tiene alguna pregunta, inquietud o solicitud relacionada con esta Política de Privacidad o con el tratamiento de sus datos personales, por favor contáctenos a través del correo electrónico: fl_team@hotmail.com. 13. Datos de Facturación Para procesar y gestionar suscripciones, recopilamos información de facturación como el identificador de la transacción, fecha de compra y renovación, y la dirección de correo asociada a su cuenta de Google Play o App Store. Estos datos se almacenan en servidores seguros y se utilizan únicamente para verificar el estado de su suscripción, gestionar renovaciones automáticas y atender solicitudes de reembolso. 14. Renovaciones y Cancelaciones Las suscripciones se renuevan automáticamente al final de cada periodo (mensual o anual). Puede cancelar la renovación automática en cualquier momento desde la configuración de Google Play (Android) o App Store (iOS). En caso de cancelación, seguirá teniendo acceso a la suscripción hasta el final del periodo ya pagado.

# termsOfServiceTitle
source: Terms of Service
es: Términos del Servicio
