Repository: JMGS93/fit-league
Catalog: lib/l10n/app_*.arb
Languages: es

# termsOfServiceContent
source: FIT LEAGUE TERMS OF SERVICE Last updated: 07/05/2025 1. Acceptance of Terms By accessing and using Fit League, you agree to these Terms of Service. If you disagree with any part of these terms, you must not use the App. 2. Service Description Fit League is designed for tracking physical activity, managing nutritional data, and offering personalized recommendations. The App is provided “as-is,” and Fit League reserves the right to modify, suspend, or discontinue the service at any time without notice. 3. Registration and User Accounts Certain features require registration and account creation. You agree to provide accurate, current, and complete information and to maintain the confidentiality of your credentials. You are responsible for all activities under your account. 4. Permitted and Prohibited Uses You agree to use the App lawfully and in compliance with all applicable regulations. Prohibited actions include: - Using the App for illegal or unauthorized purposes. - Interfering with or disrupting the App’s operation. - Infringing on intellectual property or other rights of third parties. 5. Content and Intellectual Property All content—designs, text, images, logos, and code—is owned by Fit League or third parties and protected by intellectual property laws. Unauthorized reproduction or distribution is prohibited. 5.1 User-Saved Meals 5.1.1 You may create and save custom “meals” in the App, including name, ingredients, quantities, calories, and proteins. 5.1.2 Saved meals are stored in our Firestore database and accessible only by authenticated users. 5.1.3 Deleting your account will permanently remove all associated saved meals along with other personal data. 5.1.4 You retain ownership of your recipes and grant us a limited, revocable license to store, process, and display them. 6. Privacy Data processing is governed by our Privacy Policy, which is an integral part of these Terms. Please review it to understand how we handle your information. 7. Advertising and Third Parties We use third-party ad services (e.g., Google Mobile Ads) that may collect non-personal data to optimize ad delivery. Data usage complies with the providers’ policies. You can adjust ad personalization in your device settings. 8. Warranty Disclaimer and Limitation of Liability THE APP IS PROVIDED “AS-IS” WITHOUT WARRANTIES OF ANY KIND. FIT LEAGUE DOES NOT GUARANTEE ERROR-FREE OR UNINTERRUPTED SERVICE. FIT LEAGUE IS NOT LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL, OR PUNITIVE DAMAGES ARISING FROM YOUR USE OR INABILITY TO USE THE APP. 9. Changes to Terms Fit League may update these Terms at any time. Changes take effect upon posting. Continued use of the App constitutes acceptance of the revised Terms. 10. Governing Law and Jurisdiction These Terms are governed by applicable law. Disputes will be resolved exclusively in the competent courts of the relevant jurisdiction. 11. Contact For questions about these Terms, contact us at fl_team@hotmail.com. 12. Subscriptions and Payments 12.1 Plans & Pricing - Monthly subscription: €2.99/month. - Annual subscription: €19.99/year. 12.2 Auto-Renewal Subscriptions auto-renew unless canceled at least 24 hours before the renewal date. 12.3 Cancellation Cancel auto-renewal via Google Play (Android) or App Store (iOS). You retain access until your paid period ends. 12.4 Refunds Refund requests must be made through the purchase platform (Google Play or App Store) per their policies. BY USING FIT LEAGUE, YOU AGREE TO THESE TERMS OF SERVICE.
es: TÉRMINOS DEL SERVICIO DE FIT LEAGUE Última actualización: 07/05/2025 1. Aceptación de los Términos Al acceder y utilizar Fit League, usted acepta cumplir y estar sujeto a estos Términos del Servicio. Si no está de acuerdo con alguna parte de estos términos, deberá abstenerse de utilizar la Aplicación. 2. Descripción del Servicio Fit League es una aplicación diseñada para realizar el seguimiento de la actividad física, gestionar datos nutricionales y ofrecer recomendaciones personalizadas. La Aplicación se ofrece “tal cual” y Fit League se reserva el derecho de modificar, suspender o interrumpir total o parcialmente el servicio en cualquier momento y sin previo aviso. 3. Registro y Cuentas de Usuario Para acceder a ciertas funcionalidades de la Aplicación, es necesario registrarse y crear una cuenta. Usted se compromete a proporcionar información veraz, precisa y completa durante el proceso de registro, y a mantener la confidencialidad de sus credenciales. Usted es el único responsable de todas las actividades que se realicen bajo su cuenta. 4. Uso Permitido y Usos Prohibidos Usted se compromete a utilizar la Aplicación únicamente con fines lícitos y de conformidad con todas las leyes y regulaciones aplicables. Queda expresamente prohibido: - Utilizar la Aplicación para fines ilícitos o no autorizados. - Interferir, alterar o interrumpir el funcionamiento de la Aplicación. - Infringir los derechos de propiedad intelectual o cualquier otro derecho de terceros. 5. Contenido y Propiedad Intelectual Todos los contenidos, diseños, textos, imágenes, logotipos y software incluidos en la Aplicación son propiedad de Fit League o de terceros y están protegidos por la legislación vigente en materia de propiedad intelectual. Queda prohibida la reproducción, distribución o cualquier uso no autorizado de dicho contenido sin el consentimiento expreso y por escrito de Fit League. 5.1 Platos Guardados de Usuario 5.1.1. El Usuario podrá crear y guardar “platos personalizados” dentro de la Aplicación. Cada plato incluye un nombre, lista de ingredientes, cantidades, calorías y proteínas calculadas. 5.1.2. Todos los platos guardados se almacenan en nuestra base de datos (Google Cloud Firestore) y son accesibles únicamente para el Usuario autenticado. 5.1.3. Si el Usuario elimina su cuenta, todos los platos guardados asociados a esa cuenta serán borrados permanentemente junto con el resto de sus datos personales. 5.1.4. El Usuario conserva la propiedad de las recetas e ingredientes que ha introducido y nos concede una licencia limitada, no exclusiva y revocable para almacenarlos, procesarlos y mostrárselos. 6. Privacidad El tratamiento de los datos personales se rige por nuestra Política de Privacidad, la cual forma parte integral de estos Términos del Servicio. Le recomendamos leerla detenidamente para conocer cómo protegemos su información. 7. Publicidad y Terceros Nuestra aplicación utiliza servicios de terceros para la difusión de publicidad (por ejemplo, Google Mobile Ads). Dichos servicios pueden recopilar información no personal, como identificadores del dispositivo y datos relacionados con el uso de la aplicación, con el fin de optimizar y personalizar la experiencia publicitaria. Los datos recolectados se utilizan exclusivamente para ofrecer anuncios relevantes y mejorar nuestros servicios, gestionándose conforme a las políticas de privacidad de dichos proveedores. Usted puede gestionar la personalización de anuncios a través de la configuración de su dispositivo. 8. Exclusión de Garantías y Limitación de Responsabilidad La Aplicación se proporciona “tal cual” y sin garantías de ningún tipo, sean expresas o implícitas. Fit League no garantiza que la Aplicación esté libre de errores, interrupciones o que cumpla con sus requerimientos específicos. En ningún caso Fit League será responsable por daños directos, indirectos, incidentales, especiales, consecuentes o punitivos derivados del uso o la imposibilidad de uso de la Aplicación. 9. Modificaciones de los Términos Fit League se reserva el derecho de modificar o actualizar estos Términos del Servicio en cualquier momento. Las modificaciones serán efectivas a partir de su publicación en la Aplicación. El uso continuado de la Aplicación después de la implementación de cambios constituye su aceptación de dichos términos modificados. 10. Ley Aplicable y Jurisdicción Estos Términos se regirán e interpretarán de acuerdo con las leyes de la jurisdicción aplicable. Cualquier controversia derivada del uso de la Aplicación o de estos términos será sometida a la jurisdicción exclusiva de los tribunales competentes en la ubicación correspondiente. 11. Información de Contacto Si tiene alguna pregunta o inquietud acerca de estos Términos del Servicio, por favor contáctenos a través del correo electrónico: fl_team@hotmail.com 12. Suscripción y Pagos 12.1 Planes y Precios Suscripción mensual: 2,99 € al mes. Suscripción anual: 19,99 € al año. 12.2 Renovación Automática Su suscripción se renovará automáticamente al final de cada periodo de facturación, a menos que la cancele al menos 24 horas antes de la fecha de renovación. 12.3 Cancelación Puede cancelar la renovación automática en cualquier momento desde la sección de suscripciones de Google Play (Android) o App Store (iOS). La cancelación surtirá efecto al finalizar el periodo ya pagado. 12.4 Reembolsos Las solicitudes de reembolso deberán gestionarse directamente a través de la plataforma de compra correspondiente (Google Play o App Store), de acuerdo con sus políticas de reembolso. AL UTILIZAR FIT LEAGUE, USTED ACEPTA ESTAR OBLIGADO POR ESTOS TÉRMINOS DEL SERVICIO.

# termsAcceptancePrefix
source: I agree with the
es: Estoy de acuerdo con los

# termsAcceptanceLink
source: Terms of Service
es: Términos del Servicio

# saveMealTitle
source: Save plate
es: Guardar plato

# saveMealMessage
source: Do you want to save “{autoName}” to your meals?
es: ¿Quieres guardar “{autoName}” en tus platos?

# selectOptionTitle
source: Settings
es: Ajustes

# changeDeficitText
source: Change Caloric Deficit
es: Cambiar Déficit Calórico

# nutritionalEducationText
source: Nutritional Education
es: Educación Nutricional

# nutritionalEducationContent
source: At Fit League, we believe that a balanced diet is essential for maintaining a healthy lifestyle and optimizing your physical performance. Below is a detailed guide to help you plan your meals in a balanced and delicious way. 1. The Ideal Plate The ideal plate should include foods from the three main groups: - Proteins: Essential for muscle repair and growth. Examples: chicken breast, fish, turkey, tofu, legumes. - Complex Carbohydrates: Provide sustained energy. Examples: brown rice, quinoa, whole wheat pasta, potatoes. - Vegetables and Fruits: Supply vitamins, minerals, and fiber. Examples: broccoli, spinach, carrots, apples, berries. 2. Meal Organization - Main Dish: Include a portion of lean protein (approximately the size of your palm) and a serving of complex carbohydrates (around 1 cup cooked). - Side Dishes: Complement your main dish with a generous portion of vegetables, preferably of different colors, to ensure a wide range of nutrients. You can opt for fresh salads or steamed vegetables. - Healthy Fats: Add a small portion of healthy fats, such as avocado, nuts, or a drizzle of extra virgin olive oil, to aid in vitamin absorption and provide additional energy. 3. Practical Meal Combination Examples - Example 1: Grilled chicken breast with quinoa, steamed broccoli, and a tomato-spinach salad. - Example 2: Baked salmon fillet accompanied by brown rice, asparagus, and avocado slices. - Example 3: Stir-fried tofu with a mix of bell peppers, carrots, and broccoli, served with whole-grain rice noodles. - Example 4: Lentil stew with vegetables (carrot, potato, celery) accompanied by a fresh green salad. 4. Additional Tips for a Balanced Diet - Hydration: It is essential to drink enough water throughout the day to maintain proper hydration. - Variety: Avoid eating the same meal every day. Vary your sources of proteins, carbohydrates, and vegetables to obtain all the necessary nutrients. - Portion Control: Learn to recognize appropriate portion sizes to avoid consuming more calories than needed. - Meal Planning: Organize your weekly meals in advance to maintain a balanced diet and avoid impulsive decisions. 5. Continuous Education Nutrition is an ever-evolving field. Stay informed through reliable sources and consider consulting a nutritionist to tailor your dietary needs to your lifestyle and personal goals. Follow these guidelines to improve your eating habits and support your overall well-being. A balanced diet is the foundation of an active and healthy life.
es: En Fit League, creemos que una alimentación balanceada es esencial para mantener un estilo de vida saludable y optimizar tu rendimiento físico. A continuación, te ofrecemos una guía detallada para ayudarte a planificar tus comidas de manera equilibrada y deliciosa. 1. El Plato Ideal El plato ideal debe incluir alimentos de los tres grupos fundamentales: - Proteínas: Esenciales para la reparación y el crecimiento muscular. Ejemplos: pechuga de pollo, pescado, pavo, tofu, legumbres. - Carbohidratos Complejos: Proveen energía sostenida. Ejemplos: arroz integral, quinoa, pasta integral, patatas. - Verduras y Frutas: Aportan vitaminas, minerales y fibra. Ejemplos: brócoli, espinacas, zanahorias, manzanas, bayas. 2. Organización de la Comida - Plato Principal: Incluye una porción de proteína magra (aproximadamente del tamaño de la palma de tu mano) y una fuente de carbohidratos complejos (alrededor de 1 taza cocida). - Guarniciones: Acompaña tu plato principal con una generosa porción de vegetales, preferiblemente de distintos colores, para asegurar una amplia gama de nutrientes. Puedes optar por ensaladas frescas o verduras al vapor. - Grasas Saludables: Añade una pequeña porción de grasas saludables, como aguacate, nueces o un chorrito de aceite de oliva extra virgen, para favorecer la absorción de vitaminas y aportar energía adicional. 3. Ejemplos Prácticos de Combinaciones - Ejemplo 1: Pechuga de pollo a la plancha con quinoa, brócoli al vapor y una ensalada de tomate y espinacas. - Ejemplo 2: Filete de salmón al horno acompañado de arroz integral, espárragos y rodajas de aguacate. - Ejemplo 3: Tofu salteado con una mezcla de pimientos, zanahorias y brócoli, servido con fideos de arroz integral. - Ejemplo 4: Guiso de lentejas con verduras (zanahoria, papa, apio) acompañado de una ensalada verde fresca. 4. Consejos Adicionales para una Dieta Equilibrada - Hidratación: Es fundamental beber suficiente agua a lo largo del día para mantener una buena hidratación. - Variedad: No repitas la misma comida todos los días. Varía tus fuentes de proteínas, carbohidratos y vegetales para obtener todos los nutrientes necesarios. - Control de Porciones: Aprende a identificar las porciones adecuadas para evitar consumir más calorías de las necesarias. - Planificación: Organiza tus comidas de la semana con anticipación para mantener una dieta balanceada y evitar decisiones impulsivas. 5. Educación Continua La nutrición es un campo en constante evolución. Mantente informado a través de fuentes confiables y considera consultar con un nutricionista para adaptar tus necesidades alimentarias a tu estilo de vida y objetivos personales. Sigue estos consejos para mejorar tus hábitos alimenticios y apoyar tu bienestar general. Una dieta equilibrada es la base para una vida activa y saludable.

# registerTermsTextPrefix
source: By registering, you are accepting our
es: Al registrarte, estás aceptando nuestros

# termsOfServiceLinkText
source: Terms of Service
es: Términos del Servicio

# andText
source: Find out how we manage your data on our
es: Infórmate de cómo tratamos tus datos en nuestra

# privacyPolicyLinkText
source: Privacy Policy
es: Política de Privacidad

# mealCaloriesAdjustmentTitle
source: Adjust Calories
es: Ajustar Calorías

source: Breakfast
es: Desayuno

source: Lunch
es: Almuerzo

source: Snack
es: Merienda

source: Dinner
es: Cena

# saveButton
source: Save
es: Guardar

# cancelButton
source: Cancel
es: Cancelar

# mealCaloriesSaved
source: Meal calories adjustments have been saved.
es: Los ajustes de calorías han sido guardados.

# adjustMealCaloriesText
source: Adjust Meal Calories
es: Ajustar Calorías por Comida

# mealCaloriesAdjustmentDescription
source: Adjust the calories for each meal as you wish. Make sure the total matches your allowed calories.
es: Ajusta las calorías para cada comida a tu gusto. Asegúrate de que el total coincida con tus calorías permitidas.

# mealCaloriesInvalidInput
source: Please enter valid numbers for all meals.
es: Por favor, ingresa números válidos para todas las comidas.

# mealCaloriesExcess
source: You have assigned {allowed} calories, which exceeds your allowed total of {assigned} calories.
es: Has asignado {allowed} calorías, lo que excede el total permitido de {assigned} calorías.

# mealCaloriesShortfall
source: You have assigned {allowed} calories, which is less than your allowed total of {assigned} calories.
es: Has asignado {allowed} calorías, lo que es menor al total permitido de {assigned} calorías.

# errorEmptyFields
source: Please fill in all required fields.
es: Por favor, rellena todos los campos requeridos.

# nutritionalEducationTitle
source: Nutritional Education
es: Educación Nutricional

# feedbackOptionText
source: Submit Feedback
es: Feedback

# feedbackTitle
source: ¡Give us your opinion!
es: ¡Tu opinión nos importa!

# feedbackMessage
source: How satisfied are you with our app?
es: ¿Qué tan satisfecho estás con nuestra aplicación?

# feedbackCommentHint
source: You can add comments
es: Puedes añadir un comentario

# submitButton
source: Submit
es: Enviar

# feedbackThankYou
source: Thank you for your {rating} star feedback!
es: ¡Gracias por tu feedback de {rating} estrellas!

# notificationsOptionText
source: Notifications
es: Notificaciones

# notificationsTitle
source: Settings
es: Configuración

# dailyNotificationLabel
source: Daily Motivation
es: Motivación Diaria

# weeklyNotificationLabel
source: Review Remind (Weekly)
es: Recordatorio Revisión (Semanal)

# notificationsSaved
source: Settings saved
es: Configuración guardada

# ingredientCalabaza
source: Pumpkin
es: Calabaza

# ingredientAlcachofas
source: Artichokes
es: Alcachofas

# ingredientHabas
source: Broad Beans
es: Habas

# ingredientShiitake
source: Shiitake Mushrooms
es: Setas Shiitake

# ingredientEnoki
source: Enoki Mushrooms
es: Setas Enoki

# ingredientBambu
source: Bamboo
es: Bambú

# ingredientFideosDeArroz
source: Rice Noodles
es: Fideos de Arroz

# ingredientFideosUdon
source: Udon Noodles
es: Fideos Udon

# categoriaAlgas
source: Sea Weed (RAW WEIGHT)
es: Algas (Pesar Crudo)

# menuTools
source: Tools
es: Herramientas

# menuConfiguration
source: Configuration
es: Configuración

# menuInformation
source: Information
es: Información

# menuFeedback
source: Rate Us
es: Valóranos

# targetReachedMessage
source: Congratulations, you have reached your goal! If you wish, you can choose a new target.
es: ¡Enhorabuena, has alcanzado tu objetivo! Si lo deseas, puedes elegir un nuevo objetivo.

# finalWeightLabel
source: Final Weight: {weight} kg
es: Peso Final: {weight} kg

# resultFinalWeightLabel
source: Final Weight:
es: Peso Final:

# resultWeightToLoseLabel
source: Weight to lose for {target}%
es: Peso a eliminar para {target}%:

# accountDeleteAccount
source: ACCOUNT
es: CUENTA

# accountChangePassword
source: CHANGE PASSWORD
es: CAMBIAR CONTRASEÑA

# ingredientArrozIntegral
source: Brown Rice
es: Arroz Integral

# ingredientPastaIntegral
source: Whole Wheat Pasta
es: Pasta Integral

# ingredientFideosArrozIntegral
source: Whole Grain Rice Noodles
es: Fideos de Arroz Integral

# ingredientFideosUdonIntegral
source: Whole Wheat Udon Noodles
es: Fideos Udon Integrales

# tusDatos
source: Result:
es: Resultado:

source: DAY
es: DÍA

# gymRoutineDay1
source: Chest and Triceps: Warm-up: - 10 minutes of moderate cardio (treadmill or elliptical). Exercises: 1. Bench Press: 4 sets of 8-10 reps. 2. Machine Chest Press: 3 sets of 10 reps. 3. Incline Dumbbell Press: 3 sets of 10 reps. 4. Machine Flyes: 3 sets of 12 reps. 5. Parallel Bar Dips: 3 sets of 10-12 reps. 6. V-Bar Triceps Extension: 3 sets of 15 reps. Cool-down: - 10 minutes walking on the treadmill (minimum speed 5.2).
es: Pecho y Tríceps: Calentamiento: - 10 minutos de cardio moderado (cinta o elíptica). Ejercicios: 1. Press de banca: 4 series de 8-10 repeticiones. 2. Chest Press en máquina: 3 series de 10 repeticiones. 3. Press inclinado con mancuernas: 3 series de 10 repeticiones. 4. Aperturas en máquina: 3 series de 12 repeticiones. 5. Fondos en paralelas: 3 series de 10-12 repeticiones. 6. Extensión de tríceps con barra en V: 3 series de 15 repeticiones. Enfriamiento: - 10 minutos caminando en la cinta (mínima velocidad 5.2).

# gymRoutineDay2
source: Legs and Glutes: Warm-up: - 10 minutes on a stationary bike or a light walk. Exercises: 1. Hack Squats or Barbell Squats: 4 sets of 8-10 reps. 2. Leg Extensions: 3 sets of 10-12 reps. 3. Leg Press: 3 sets of 10 reps. 4. Lying or Seated Leg Curls: 3 sets of 10-12 reps. 5. Abductor Machine: 3 sets of 10-12 reps. 6. Calf Raises: 3 sets of 15-20 reps. Cool-down: - 10 minutes walking on the treadmill (minimum speed 5.2).
es: Pierna y Glúteo: Calentamiento: - 10 minutos de bicicleta estática o caminata ligera. Ejercicios: 1. Sentadillas en hack o con barra: 4 series de 8-10 repeticiones. 2. Extensión cuádriceps: 3 series de 10-12 repeticiones. 3. Prensa: 3 series de 10 repeticiones. 4. Femoral (tumbado o sentado): 3 series de 10-12 repeticiones. 5. Abductores: 3 series de 10-12 repeticiones. 6. Elevación de gemelos: 3 series de 15-20 repeticiones. Enfriamiento: - 10 minutos caminando en la cinta (mínima velocidad 5.2).

# gymRoutineDay3
source: Back and Biceps: Warm-up: - 10 minutes on a rowing machine or moderate cardio. Exercises: 1. Wide-Grip Lat Pulldown: 4 sets of 8-10 reps. 2. Wide-Grip Lat Pulldown (Reverse Grip): 3 sets of 10 reps. 3. Seated Cable Row (Close Grip): 3 sets of 10 reps. 4. Lat Pulldown Machine: 3 sets of 10-12 reps. 5. Machine Row with Open Grip: 3 sets of 10-12 reps. 6. Biceps Curl: 3 sets of 10-12 reps. 7. Hammer Curl: 3 sets of 10 reps. Cool-down: - 10 minutes walking on the treadmill (minimum speed 5.2).
es: Espalda y Bíceps: Calentamiento: - 10 minutos en máquina de remo o cardio moderado. Ejercicios: 1. Jalón al pecho con barra abierta: 4 series de 8-10 repeticiones. 2. Jalón al pecho con barra abierta (reverse grip): 3 series de 10 repeticiones. 3. Remo con agarre cerrado: 3 series de 10 repeticiones. 4. Lat Pulldown en máquina: 3 series de 10-12 repeticiones. 5. Remo con agarre abierto en máquina: 3 series de 10-12 repeticiones. 6. Curl de bíceps: 3 series de 10-12 repeticiones. 7. Curl martillo: 3 series de 10 repeticiones. Enfriamiento: - 10 minutos caminando en la cinta (mínima velocidad 5.2).

# gymRoutineDay4
source: Full Body HIIT Circuit: Warm-up: - 10 minutes on the elliptical. Circuit (perform 3 rounds, resting 1-2 minutes between rounds): 1. Push-ups: 3 x 15 reps. 2. Jump Squats: 3 x 15 reps. 3. Lying Crunches: 3 x 15 reps. 4. Burpees: 3 x 10 reps. 5. Mountain Climbers: 3 x 10 reps per side. Cool-down: - 10 minutes walking on the treadmill (minimum speed 5.2).
es: Circuito Full Body HIIT: Calentamiento: - 10 minutos en elíptica. Circuito (realizar 3 rondas, descansando 1-2 minutos entre rondas): 1. Flexiones: 3 x 15 repeticiones. 2. Sentadillas con salto: 3 x 15 repeticiones. 3. Crunches tumbado: 3 x 15 repeticiones. 4. Burpees: 3 x 10 repeticiones. 5. Mountain climbers: 3 x 10 repeticiones por lado. Enfriamiento: - 10 minutos caminando en la cinta (mínima velocidad 5.2).
