Repository: JMGS93/fit-league
Catalog: lib/l10n/app_*.arb
Languages: es

# welcome
source: Welcome to Fit League The ultimate fitness plan
es: Bienvenido a Fit League El plan fitness definitivo

# loginPrompt
source: Sign in or register
es: Inicia sesión o regístrate

# signInButton
source: Sign In
es: Iniciar sesión

# noAccount
source: Don't have an account? Create one here
es: ¿No tienes cuenta? Crea una aquí

# errorEnterEmailPassword
source: Please enter email and password.
es: Por favor, ingrese correo y contraseña.

# invalidEmailFormat
source: Please enter a valid email address.
es: Por favor, ingrese un correo válido.

# errorSignIn
source: An error occurred while signing in.
es: Ocurrió un error al iniciar sesión.

# errorUserDisabled
source: This user has been disabled.
es: Este usuario ha sido inhabilitado.

# errorUserNotFound
source: No user found with this email.
es: No existe un usuario con este correo.

# errorWrongPassword
source: Incorrect password.
es: La contraseña es incorrecta.

# errorTooManyRequests
source: Too many attempts. Please try again later.
es: Demasiados intentos. Por favor, inténtalo más tarde.

source: Reset Password
es: Restablecer Contraseña

# resetPasswordDescription
source: Enter your email address to receive a reset link.
es: Introduce tu correo electrónico y recibirás un enlace de restablecimiento

# resetButton
source: Reset Password
es: Restablecer contraseña

# resetSuccess
source: A reset link has been sent to your email.
es: Se ha enviado un enlace de restablecimiento a tu correo.

# resetError
source: Error resetting password.
es: Error al restablecer la contraseña

# alcanzado
source: Achieved
es: Alcanzado

# registerTitle
source: Create an account
es: Crea una cuenta

# emailHint
source: Email Address
es: Correo Electrónico

# passwordHint
source: Password
es: Contraseña

# createAccountButton
source: Create Account
es: Crear cuenta

# errorGenericRegister
source: An error occurred. Please try again.
es: Ocurrió un error. Por favor, inténtalo de nuevo.

# errorEmailAlreadyInUse
source: This email is already registered. Try another one.
es: Este correo ya está registrado. Intenta con otro.

# errorInvalidEmail
source: The provided email address is not valid.
es: El correo electrónico proporcionado no es válido.

# errorWeakPassword
source: The password is too weak. Please choose a stronger one.
es: La contraseña es muy débil. Por favor, elige otra más segura.

# errorOperationNotAllowed
source: This operation is not allowed. Contact the administrator.
es: Esta operación no está habilitada. Contacta al administrador.

# storeResults
source: Store results here
es: Aquí almacena los resultados

# welcomeHeadline
source: Your physical transformation starts now!
es: ¡Tu cambio físico empieza ahora!

# welcomeDescription
source: Estimate how many days you need to lower your body fat to 20 %, 15 % or even 10 % if you want defined abs and get a complete, science-based nutrition and workout plan to tackle stubborn belly fat realistically and effectively.
es: Calcula cuántos días necesitas para bajar tu grasa corporal al 20 %, 15 % o incluso al 10 % si tu objetivo es definir el abdomen. Con nuestro plan integral de alimentación y entrenamiento basado en ciencia, perderás la grasa abdominal más rebelde de forma realista y alcanzable.

# welcomeImportant
source: IMPORTANT: please review all information before starting and make sure you have enough time. Next, we’ll explain our method.
es: IMPORTANTE: revisa toda la información antes de empezar y asegúrate de tener tiempo suficiente. A continuación explicamos nuestro método.

# readyToContinue
source: I am ready to continue.
es: Estoy listo para continuar.

# continueButton
source: Continue
es: Adelante

# informationTitle
source: Important Information
es: Información Importante

# informationParagraph1
source: We use the US Navy formula to quickly and accurately estimate your body fat percentage.
es: Usamos el método de la Marina de EE. UU. para estimar tu porcentaje de grasa corporal de forma rápida y precisa.

# informationParagraph2
source: We calculate your fat mass by subtracting it from your total weight, distinguishing it from lean mass.
es: Calculamos tu masa grasa restándola de tu peso total, diferenciándola de tu masa magra.

# informationParagraph3
source: Then we determine your target weight at 20 %, 15 %, or 10 % body fat and how many kilos you need to lose.
es: A partir de ahí determinamos tu peso objetivo al 20 %, 15 % o 10 % de grasa y los kilos que debes perder.

# informationParagraph4
source: We convert those kilos into calories: 1 kg of fat ≈ 7700 kcal.
es: Convertimos esos kilos en calorías: 1 kg de grasa equivale a ~7700 kcal.

# informationParagraph5
source: With a daily calorie deficit and simple exercise, we estimate how many days it will take to reach your goal.
es: Con un déficit diario de calorías y ejercicio sencillo, estimamos cuántos días te tomará alcanzar tu meta.

# informationParagraph6
source: Set your goal on a visible calendar and count down the days to your new version.
es: Marca tu objetivo en un calendario visible y cuenta los días hasta tu nueva versión.

# informationParagraph7
source: If you are ready and have understood the process, let's move on to the next step.
es: Si estás listo y has comprendido el proceso, avancemos al siguiente paso.

# informationCheckboxText
source: I have read and understood this information.
es: He leído y comprendo esta información.

# genderSelectionTitle
source: Select your gender
es: Selecciona tu género

# deficitSelectionInfoMen
source: Remember, for men the daily caloric base is 2800, and you cannot choose a deficit greater than 700.
es: Recuerda, para hombres la base calórica es 2800/dia, y no puedes elegir un déficit superior a 700.

# deficitSelectionInfoWomen
source: For women, the daily base is 2200, and you cannot choose a deficit greater than 500. Later, you can change your deficit in the main section if you wish.
es: Para mujeres, la base diaria es 2200/dia, y no puedes elegir un déficit superior a 500. Más adelante, podrás cambiar tu déficit si así lo deseas desde la sección principal.

# genderContinueButton
source: Continue
es: Continuar

# caloriePlanStep1
source: Step 1.
es: Paso 1.

# caloriePlanTitle
source: Let's define your calorie deficit plan
es: Definamos tu plan de déficit calórico

# caloriePlanIntro
source: Before setting your calorie deficit, please read carefully:
es: Antes de establecer tu déficit calórico, lee detenidamente:

# caloriePlanParagraph1
source: To reach 20 %, 15 %, or 10 % body fat, maintain a daily calorie deficit—eat less than you burn. Fit League lets you choose your deficit within safe limits.
es: Para alcanzar un 20 %, 15 % o 10 % de grasa corporal, mantén un déficit calórico diario, osea consume menos de lo que gastas. En Fit League puedes elegir tu déficit dentro de límites seguros.

# caloriePlanQuestion
source: How does a calorie deficit affect you?
es: ¿Cómo impacta el déficit calórico?

# caloriePlanParagraph2
source: A larger deficit speeds up fat loss but demands more discipline. Balancing your deficit is key for physical and mental well-being.
es: Un déficit mayor acelera la pérdida de grasa, pero exige más disciplina. Equilibrar tu déficit es clave para tu bienestar físico y mental.

# caloriePlanLimitsTitle
source: Healthy calorie deficit:
es: Déficit calórico saludable:

# caloriePlanLimitsMale
source: Men: up to 700 kcal deficit (from 2800 kcal), min intake 2100 kcal—enough for a balanced diet.
es: Hombres: hasta 700 kcal de déficit (base 2800 kcal), ingesta mínima 2100 kcal, suficiente para una dieta equilibrada.

# caloriePlanLimitsFemale
source: Women: up to 500 kcal deficit (from 2200 kcal), min intake 1700 kcal. We include hip measurement for more precise estimates.
es: Mujeres: hasta 500 kcal de déficit (base 2200 kcal), ingesta mínima 1700 kcal.

# caloriePlanHighOrModerate
source: High or moderate deficit? You decide
es: ¿Déficit alto o moderado? Tú decides

# caloriePlanSafety
source: These limits follow health guidelines to ensure adequate nutrients and energy.
es: Estos límites siguen guías de salud, garantizando nutrientes y energía suficientes.

# caloriePlanWeightLoss
source: Controlled deficit = healthy weight loss; too much deficit can cause muscle loss or deficiencies.
es: Déficit controlado = pérdida de peso saludable; un déficit excesivo puede causar pérdida muscular o carencias.

# caloriePlanMinimumIntake
source: Minimum intake: 2100 kcal for men, 1700 kcal for women to maintain basic functions.
es: Ingesta mínima: 2100 kcal en hombres y 1700 kcal en mujeres para mantener funciones básicas.

# caloriePlanSustainability
source: A moderate deficit is more sustainable long-term, avoiding extreme hunger or fatigue.
es: Un déficit moderado es más sostenible a largo plazo, evitando fatiga o desmotivación.

# caloriePlanConsultProfessional
source: Consult a healthcare professional before starting to ensure it fits your needs.
es: Consulta a un profesional antes de empezar para adaptar el plan a tus necesidades.

# caloriePlanCheckbox
source: I have read and understood this information.
es: He leído y comprendo esta información.

# caloriePlanStartButton
source: Start
es: Comenzar

# deficitSelectionTitle
source: Choose a Calorie Deficit
es: Elige un déficit calórico

# deficitSelectionDescription
source: To reach your goal safely, it is not recommended to exceed a daily calorie deficit of {maxDeficit} calories.
es: Para alcanzar tu objetivo de manera segura, no es recomendable exceder un déficit calórico diario de {maxDeficit} calorías.

# deficitSelectionInputLabel
source: Enter your calorie deficit (calories)
es: Introduce tu déficit calórico (calorías)

# deficitSelectionInputError
source: Enter a value between 0 and {maxDeficit}.
es: Introduce un valor entre 0 y {maxDeficit}.

# deficitSelectionContinueButton
source: Continue
es: Continuar

# errorHipRequired
source: Please enter the hip circumference.
es: Por favor, introduce la circunferencia de la cadera.

# errorAllDataRequired
source: Please enter all required data.
es: Por favor, introduce todos los datos requeridos.

# resultText
source: Your body fat percentage is {igc}%.
es: Tu porcentaje de grasa corporal es {igc}%.

# errorSavingFirestore
source: Error saving to Firestore: {error}
es: Error al guardar en Firestore: {error}

source: Close
es: Cerrar

# cinturaTitle
source: Waist
es: Cintura

# cuelloTitle
source: Neck
es: Cuello

# alturaTitle
source: Height
es: Altura

# caderaTitle
source: Hip
es: Cadera

# pesoTitle
source: Weight
es: Peso

# cinturaLabel
source: Waist circumference (cm)
es: Circunferencia de la cintura (cm)

# cuelloLabel
source: Neck circumference (cm)
es: Circunferencia del cuello (cm)

# alturaLabel
source: Height (cm) without comas
es: Altura (cm) sin comas

# caderaLabel
source: Hip circumference (cm)
es: Circunferencia de la cadera (cm)

# pesoLabel
source: Current weight (kg)
es: Peso actual (kg)

source: Enter your data
es: Introduce tus datos

source: Change target to 10%
es: Cambiar objetivo a 10%

source: Change target to 15%
es: Cambiar objetivo a 15%

source: Change target to 20%
es: Cambiar objetivo a 20%

# objectiveText
source: Objective: {value}% Body Fat
es: Objetivo: {value}% Grasa Corporal

# calculateButton
source: Calculate
es: Calcular

source: View example
es: Ver ejemplo

# alternativeCalculationButton
source: Formula 2
es: Fórmula 2

# alternativeCalculationTitle
source: Formula 2
es: Fórmula 2

# igcInfoTitle
source: Methods to measure your IGC
es: Métodos para medir tu IGC

# errorSavingMeal
source: Error saving meal: {message}
es: Error al guardar el plato: {message}

# igcInfoDontShowAgain
source: Don't show this message again
es: No volver a mostrar este mensaje

# alternativeCalculationDescription
source: Deurenberg formula for Body Fat Percentage.
es: Fórmula de Deurenberg para IGC.

# igcInfoMessage
source: Here you can choose between two methods to calculate your BFP. If you want a highly accurate result, use the first formula, which is used by the United States Navy. Alternatively, you can switch to the Deurenberg formula (Formula 2), which allows you to obtain your BFP without using a measuring tape. However, the result will not be as precise. For this method, you only need to know your age, weight, and height. Choose the one that best suits your needs. IMPORTANT: Once you select a formula for your initial calculation, you must use the same one for future assessments. Otherwise, your results will not be consistent, which may lead to errors in the process.
es: Aquí podrás elegir entre dos métodos para calcular tu IGC. Si quieres un resultado altamente preciso, utiliza la primera fórmula, utilizada por la Marina de los Estados Unidos. De forma alternativa, puedes cambiar a la fórmula Deurenberg (Fórmula 2), donde podrás obtener tu IGC sin necesidad de utilizar la cinta métrica, solo que el resultado no será tan preciso. Para ello solo necesitas saber tu edad, peso y altura. Elige el que mejor se adapte a tus necesidades. IMPORTANTE: Una vez elegida la fórmula para el cálculo de tu primer registro, deberás utilizar la misma para tus revisiones futuras. De lo contrario, tus resultados no serán consistentes, y puede dar cabida a errores en el proceso.

# ageTitle
source: Age
es: Edad

# ageLabel
source: Enter your age
es: Ingresa tu edad

# heightTitle
source: Height
es: Altura

# heightLabel
source: Enter your height in cm (no comas)
es: Ingresa tu altura en cm (sin comas)

# weightTitle
source: Weight
es: Peso

# weightLabel
source: Enter your weight in kg
es: Ingresa tu peso en kg

# genderFemale
source: Female
es: Mujer

# resultTitle
source: Report
es: Informe

# resultBodyFatLabel
source: Body Fat Percentage:
es: Porcentaje de Grasa Corporal:

# resultLeanMassLabel
source: Lean Mass:
es: Peso de Masa Magra:

# resultFatMassLabel
source: Fat Mass:
es: Peso de Masa Grasa:

# resultTotalCaloriesLabel
source: Total Calories to Burn:
es: Calorías totales a quemar:

# resultChangeTargetButton
source: Change %
es: Cambiar %

# searchHint
source: Search...
es: Buscar...

# resultHomeButton
source: Enter
es: Entrar

# resultInfoText
source: If your body fat percentage is already around 15%, you can change your target to 10%. Alternatively, if you are aiming for a closer target, you can choose 20%. Tap "Change %" to return to the calculation screen, then press the "%" symbol.
es: ¿Tu IGC ya es cercano a 15%? Puedes cambiar tu objetivo a 10%. También, puedes elegir 20%, si quieres empezar por algo más fácil. Accede a "Cambiar %" y volverás a la pantalla de cálculos. Una vez allí, pulsa el símbolo "%".

# accountTitle
source: My Account
es: Mi Cuenta

# accountEmail
source: Email
es: Correo

# accountNewPassword
source: New Password
es: Nueva contraseña

source: Error loading video
es: Error al cargar el vídeo

# accountSaveChanges
source: Save Changes
es: Guardar cambios

# accountDelete
source: Delete Account
es: Eliminar cuenta

source: Account updated
es: Cuenta actualizada

# errorUpdatingAccount
source: Error updating account: {error}
es: Error al actualizar la cuenta: {error}

# searchNoResultsMessage
source: No recipes match your search
es: No se encontraron recetas

# errorDeletingAccount
source: Error deleting account: {error}
es: Error al eliminar la cuenta: {error}

# subscribePrompt
source: To unlock the ability to save your meals, subscribe to Fit League for just €2.99. Don’t worry—if you don’t subscribe, you can still generate meals, you just won’t be able to store them.
es: Para desbloquear la función de guardar tus platos, suscríbete a Fit League por tan sólo 2,99€. No te preocupes, aunque no te suscribas podrás seguir generando platos, solo que no podrás almacenarlos.

# subscribeButton
source: SUBSCRIBE
es: SUSCRÍBETE

# ingredientClarasPasteurizadas
source: Pasteurized egg whites
es: Claras pasteurizadas

# ingredientHuevosCodorniz
source: Quail eggs
es: Huevos de codorniz

# ingredientCarneCorderoMagra
source: Lean lamb meat
es: Carne de cordero magra

# ingredientPechugaPato
source: Duck breast
es: Pechuga de pato

# ingredientCarneConejo
source: Rabbit meat
es: Carne de conejo

# ingredientTruchaArcoiris
source: Rainbow trout
es: Trucha arcoíris

# ingredientVieiras
source: Scallops
es: Vieiras

# ingredientQuesoManchegoSemicurado
source: Semi-cured Manchego cheese
es: Queso manchego semicurado

# ingredientQuesoFetaLight
source: Light feta cheese
es: Queso feta light

# ingredientMijoCocido
source: Cooked millet
es: Mijo cocido

# ingredientPanCentenoIntegral
source: Whole-grain rye bread
es: Pan de centeno integral

# ingredientFrutosBosqueMixtos
source: Mixed berries
es: Frutos del bosque mixtos

# ingredientGranada
source: Pomegranate
es: Granada

# ingredientKefirCabra
source: Goat kefir
es: Kéfir de cabra

# categoriaCordero
source: Lamb (raw weight)
es: Cordero (Pesar Crudo)

# categoriaPato
source: Duck (raw weight)
es: Pato (Pesar Crudo)

# categoriaConejo
source: Rabbit (raw weight)
es: Conejo (Pesar Crudo)

source: Delete
es: Eliminar

# deleteConfirmationTitle
source: Delete dish?
es: ¿Eliminar plato?

# deleteConfirmationMessage
source: Are you sure you want to delete "{name}"?
es: ¿Seguro que quieres eliminar "{name}"?

# myKitchenTitle
source: My Recipes
es: Mis Recetas

# noRecipesMessage
source: No recipes available
es: No hay recetas disponibles

# menuTitle
source: Menu
es: Menú

# menuAccount
source: My Account
es: Mi Cuenta

source: Meal saved!
es: ¡Plato guardado!

# menuLanguage
source: Languages
es: Idiomas

# menuLogout
source: Log Out
es: Cerrar sesión

# authTitle
source: Authentication
es: Autenticación

# registerButton
source: Register
es: Registro

# loginButton
source: Login
es: Iniciar Sesión

source: Or sign in with
es: O inicia sesión con

source: Sign in with Google
es: Inicia sesión con Google

# registrationFirstMessage
source: You must register and create an account first.
es: Debe registrarse y crear una cuenta primero.

source: Sign in with Facebook
es: Inicia sesión con Facebook

source: Sign in with Apple
es: Inicia sesión con Apple

source: Error saving data.
es: Error al guardar los datos.

source: Error loading data.
es: Error al cargar los datos.

# languageDialogTitle
source: Select Language
es: Selecciona Idioma

# languageOptionSpanish
source: Spanish
es: Español

# languageOptionEnglish
source: English
es: Inglés

# genderMale
source: Male
es: Hombre

source: Not available
es: No disponible

# congratulationsMessage
source: Congratulations! You have improved your body fat percentage by {value}%. Keep it up! Your dream body is just around the corner!
es: ¡Felicidades! Has mejorado tu porcentaje de grasa corporal en {value}%. ¡Sigue así! ¡Tu físico soñado está a la vuelta de la esquina!

# attentionMessage
source: Attention! Your body fat percentage has increased by {value}%. It is a good time to review your habits and get back on track.
es: ¡Atención! Tu porcentaje de grasa corporal ha aumentado en {value}%. Es un buen momento para evaluar tus hábitos y retomar el rumbo hacia tus objetivos.

# keepWorkingMessage
source: Keep working! Your body fat percentage remains at {value}%.
es: ¡Sigue trabajando! Tu porcentaje de grasa corporal se mantiene en {value}%.

# progressUpdatedTitle
source: Progress Updated!
es: ¡Progreso Actualizado!

# daysRemaining
source: Days remaining: {days}
es: Días restantes: {days}

# closeButton
source: Close
es: Cerrar

# leanMassLabel
source: Lean Mass
es: Masa Magra

# fatMassLabel
source: Fat Mass
es: Masa Grasa

# progressTitle
source: MY PROGRESS
es: MI PROGRESO

# leanMassText
source: Lean Mass: {value} Kg
es: Masa Magra: {value} Kg

# fatMassText
source: Fat Mass: {value} Kg
es: Masa Grasa: {value} Kg

# premiumFunctionTitle
source: Premium Feature
es: Función Premium

# reviewButtonText
source: Review
es: Revisión

# reportButtonText
source: Report
es: Informe

# reviewDescription
source: In Review, you can enter measurements and update your progress. You can do this weekly or biweekly. Access Report to change your goal.
es: En Revisión, podrás ingresar medidas y actualizar tu progreso. Puedes hacerlo semanal o quincenalmente. En Informe podrás cambiar tu objetivo.

# routineTitle
source: MY ROUTINE
es: MI RUTINA

# trainingDay1Title
source: Day 1: Cardio + Legs & Glutes
es: Día 1: Cardio + Piernas y Glúteos

# trainingDay1Exercise1
source: Treadmill: 30 minutes (200-250 calories)
es: Caminar en la cinta: 30 minutos (200-250 calorías)

# trainingDay1Exercise2
source: Squats: 3 sets of 12 reps
es: Sentadillas: 3 series de 12 repeticiones

# trainingDay1Exercise3
source: Lunges: 3 sets of 12 reps per leg
es: Estocadas: 3 series de 12 repeticiones por pierna

# trainingDay1Exercise4
source: Glute Bridge: 3 sets of 15 reps
es: Puente de glúteos: 3 series de 15 repeticiones

# trainingDay1Exercise5
source: Plank: 2 sets of 30 seconds
es: Plancha: 2 series de 30 segundos

# trainingDay2Title
source: Day 2: Cardio + Chest & Triceps
es: Día 2: Cardio + Pecho y Tríceps

# trainingDay2Exercise1
source: Treadmill: 30 minutes (200-250 calories)
es: Caminar en la cinta: 30 minutos (200-250 calorías)

# trainingDay2Exercise2
source: Push-ups: 3 sets of 10-15 reps
es: Flexiones de pecho: 3 series de 10-15 repeticiones

# trainingDay2Exercise3
source: Bench Dips: 3 sets of 12 reps
es: Fondos en banco: 3 series de 12 repeticiones

# trainingDay2Exercise4
source: Dumbbell Flyes: 3 sets of 12 reps
es: Aperturas con mancuernas: 3 series de 12 repeticiones

# trainingDay2Exercise5
source: Resistance Band Triceps Extension: 3 sets of 12 reps
es: Extensión de tríceps con banda elástica: 3 series de 12 repeticiones

# trainingDay3Title
source: Day 3: Cardio + Back & Biceps
es: Día 3: Cardio + Espalda y Bíceps

# trainingDay3Exercise1
source: Treadmill: 30 minutes (200-250 calories)
es: Caminar en la cinta: 30 minutos (200-250 calorías)

# trainingDay3Exercise2
source: Resistance Band Row: 3 sets of 12 reps
es: Remo con banda elástica: 3 series de 12 repeticiones

# trainingDay3Exercise3
source: Dumbbell Biceps Curl: 3 sets of 12 reps
es: Curl de bíceps con mancuernas: 3 series de 12 repeticiones

# trainingDay3Exercise4
source: Resistance Band Pull-aparts: 3 sets of 15 reps
es: Pull-aparts con banda elástica: 3 series de 15 repeticiones

# trainingDay3Exercise5
source: Superman: 3 sets of 15 reps
es: Superman: 3 series de 15 repeticiones

# trainingDay4Title
source: Day 4: Cardio + Core
es: Día 4: Cardio + Core

# trainingDay4Exercise1
source: Treadmill: 30 minutes (200-250 calories)
es: Caminar en la cinta: 30 minutos (200-250 calorías)

# trainingDay4Exercise2
source: Crunches: 3 sets of 15 reps
es: Crunches: 3 series de 15 repeticiones

# trainingDay4Exercise3
source: Leg Raises: 3 sets of 12 reps
es: Elevación de piernas: 3 series de 12 repeticiones

# trainingDay4Exercise4
source: Air Bicycle: 3 sets of 15 reps per side
es: Bicicleta en el aire: 3 series de 15 repeticiones por lado

# trainingDay4Exercise5
source: Plank: 3 sets of 30 seconds
es: Plancha: 3 series de 30 segundos

# trainingDay5Title
source: Day 5: Cardio + Full Body
es: Día 5: Cardio + Full Body

# trainingDay5Exercise1
source: Treadmill: 30 minutes (200-250 calories)
es: Caminar en la cinta: 30 minutos (200-250 calorías)

# trainingDay5Exercise2
source: Jump Squats: 3 sets of 10 reps
es: Salto: 3 series de 10 repeticiones

# trainingDay5Exercise3
source: Push-ups: 3 sets of 10-15 reps
es: Flexiones de pecho: 3 series de 10-15 repeticiones

# trainingDay5Exercise4
source: Resistance Band Row: 3 sets of 12 reps
es: Remo con banda elástica: 3 series de 12 repeticiones

# trainingDay5Exercise5
source: Glute Bridge: 3 sets of 15 reps
es: Puente de glúteos: 3 series de 15 repeticiones

# trainingDay5Exercise6
source: Plank: 2 sets of 30 seconds
es: Plancha: 2 series de 30 segundos

# dietTitle
source: MY DIET
es: MI DIETA
