Repository: JMGS93/fit-league
Catalog: lib/l10n/app_*.arb
Languages: es

# gymRoutineDay5
source: Shoulders and Core: Warm-up: - 5 minutes of light cardio (jump rope or light jogging). Exercises: 1. Machine Military Press: 4 sets of 8-10 reps. 2. Dumbbell Military Press: 3 sets of 8-10 reps. 3. Lateral Raises: 3 sets of 12 reps. 4. Front Raises: 3 sets of 12 reps. 5. Lying Crunches: 3 sets of 25 reps. 6. Plank: 3 sets of 60 seconds. Cool-down: - 10 minutes walking on the treadmill (minimum speed 5.2).
es: Hombros y Core: Calentamiento: - 5 minutos de cardio ligero (cuerda o trote suave). Ejercicios: 1. Press militar en máquina: 4 series de 8-10 repeticiones. 2. Press militar con mancuernas: 3 series de 8-10 repeticiones. 3. Elevaciones laterales: 3 series de 12 repeticiones. 4. Elevaciones frontales: 3 series de 12 repeticiones. 5. Crunches tumbado: 3 series de 25 repeticiones. 6. Plancha: 3 series de 60 segundos. Enfriamiento: - 10 minutos caminando en la cinta (mínima velocidad 5.2).

# noGymRoutineDay1
source: Chest and Triceps (Home): Warm-up: - 5 minutes of jump rope or jumping jacks. Exercises: 1. Push ups: 4 sets of 12-15 reps. 2. Wide Push-ups: 3 sets of 10-12 reps. 3. Diamond Push-ups: 3 sets of 10-12 reps. 4. Incline Push-ups: 3 sets of 12 reps. 5. Elevated Feet Push-ups: 3 sets of 10-12 reps. Cool-down: - 5 minutes of jump rope or jumping jacks.
es: Pecho y Tríceps (Casa): Calentamiento: - 5 minutos de saltos con cuerda o jumping jacks. Ejercicios: 1. Flexiones normales: 4 series de 12-15 repeticiones. 2. Flexiones abiertas: 3 series de 10-12 repeticiones. 3. Flexiones de brazos con manos juntas (diamante): 3 series de 10-12 repeticiones. 4. Flexiones inclinadas: 3 series de 12 repeticiones. 5. Flexiones con pies en superficie elevada: 3 series de 10-12 repeticiones. Enfriamiento: - 5 minutos de saltos con cuerda o jumping jacks.

# noGymRoutineDay2
source: Legs and Glutes (Home): Warm-up: - 5 minutes of jogging in place or skipping. Exercises: 1. Bodyweight Squats: 4 sets of 15-20 reps. 2. Sumo Squats: 3 sets of 12 reps. 3. Jump Squats: 3 sets of 10-12 reps. 4. Alternating Lunges: 3 sets of 12 reps per leg. 5. Standing Calf Raises: 3 sets of 20 reps. Cool-down: - 5-10 minutes of leg and glute stretches.
es: Pierna y Glúteo (Casa): Calentamiento: - 5 minutos de trote en el lugar o skipping. Ejercicios: 1. Sentadillas con peso corporal: 4 series de 15-20 repeticiones. 2. Sentadillas sumo: 3 series de 12 repeticiones. 3. Sentadillas con salto: 3 series de 10-12 repeticiones. 4. Zancadas alternas: 3 series de 12 repeticiones por pierna. 5. Elevación de gemelos de pie: 3 series de 20 repeticiones. Enfriamiento: - 5-10 minutos de estiramientos de piernas y glúteos.

# noGymRoutineDay3
source: Core and Lower Abs (Home): Warm-up: - 5 minutes of joint mobility and core activation (e.g., light jumping or hip rotations). Exercises: 1. Front plank: 3 sets of 45-60 seconds. 2. Leg Raises: 3 sets of 12-15 reps. 3. Abdominal crunches: 3 sets of 20 reps. 4. Side plank: 3 sets of 30-45 seconds per side. 5. Heel Touch Crunches: 3 sets of 15 reps. 6. Leg Raise at 40°: 3 sets. 7. Scissor Kicks: 3 sets of 15 reps per leg. Cool-down: - 5-10 minutes of core and abdominal stretches.
es: Core y Abdomen Bajo (Casa): Calentamiento: - 5 minutos de movilidad articular y activación del core (por ejemplo, saltos ligeros en el lugar o rotaciones de cintura). Ejercicios: 1. Plancha Frontal: 3 series de 45-60 segundos. 2. Elevaciones de piernas: 3 series de 12-15 repeticiones. 3. Crunches Tumbado: 3 series de 20 repeticiones. 4. Plancha Lateral: 3 series de 30-45 segundos por lado. 5. Crunches tocando los talones: 3 series de 15 repeticiones. 6. Levantamiento de piernas juntas estático a 40°: 3 series. 7. Tijeritas: 3 series de 15 repeticiones por pierna. Enfriamiento: - 5-10 minutos de estiramientos para el core y abdomen.

# noGymRoutineDay4
source: Full Body HIIT Circuit (Home): Warm-up: - 5 minutes of light jumping or jogging in place. Circuit (perform 3 rounds, resting 1-2 minutes between rounds): 1. Push-ups: 3 x 15 reps. 2. Jump squats: 3 x 15 reps. 3. Crunches: 3 x 15 reps. 4. Burpee: 3 x 10 reps. 5. Mountain-Climbers: 3 x 10 reps per side. Cool-down: - 5 minutes of general stretching.
es: Circuito Full Body HIIT (Casa): Calentamiento: - 5 minutos de saltos suaves o jogging en el lugar. Circuito (realizar 3 rondas, descansando 1-2 minutos entre rondas): 1. Flexiones de brazos: 3 x 15 repeticiones. 2. Sentadillas con salto: 3 x 15 repeticiones. 3. Crunches abdominales: 3 x 15 repeticiones. 4. Burpees: 3 x 10 repeticiones. 5. Escaladores (mountain climbers): 3 x 10 repeticiones por lado. Enfriamiento: - 5 minutos de estiramientos generales.

# noGymRoutineDay5
source: To choose (Home): Today you may choose to repeat either the Chest and Triceps routine or the Legs and Glutes routine, whichever suits you best, to continue strengthening your workout without the gym.
es: A elegir (Casa): Hoy puedes optar por repetir la rutina de Pecho y Tríceps o la de Pierna y Glúteos, según te convenga, para continuar fortaleciendo tu entrenamiento sin necesidad de gimnasio.

# consejos
source: TIPS
es: CONSEJOS

# gymTips1
source: During your workouts, we recommend resting between 1 and 3 minutes between sets for proper recovery. If using heavy weights, you may extend rest up to 5 minutes.
es: Durante tus entrenamientos, te recomendamos descansar entre 1 y 3 minutos entre series para una recuperación adecuada. Si utilizas pesos elevados, podrías considerar extender el descanso hasta 5 minutos.

# gymTips2
source: Remember this app is designed mainly for weight loss and muscle toning, not specifically for hypertrophy. Therefore, pushing sets to failure is not required unless you prefer it.
es: Recuerda que la aplicación está diseñada principalmente para adelgazar y mejorar la tonificación muscular, y no tanto para fomentar la hipertrofia. Por ello, puedes optar por no llevar las series al fallo si lo crees conveniente.

# gymTips3
source: Extreme training intensity isn't necessary for your goals. A balanced routine with consistent effort and rest is more effective.
es: No es necesario entrenar con intensidades extremas propias de un enfoque de hipertrofia. Lo importante es mantener una rutina equilibrada, en la que el esfuerzo y el descanso se combinen para optimizar resultados.

# gymTips4
source: We recommend taking at least 2 rest days per week. You can organize them however best suits you, but they are essential for proper recovery.
es: Se recomienda disponer de al menos 2 días de descanso a la semana, los cuales puedes organizar como mejor te convenga. Estos días son clave para permitir que tu cuerpo se recupere correctamente.

# gymTips5
source: After training, it is advisable to consume a source of fast-absorbing protein, such as pure protein shakes mixed with water. With an approximate caloric value of 100 calories, they can be added unofficially to your diet without significant impact.
es: Después de entrenar, se aconseja consumir una fuente de proteínas de rápida absorción, como batidos de proteína pura mezclados con agua. Su aporte calórico, aproximadamente 100 calorías, permite integrarlos de manera extraoficial en la dieta sin un impacto significativo.

# gymTips6
source: If you experience intense muscle soreness, it is crucial to take the necessary rest until you fully recover. Allowing your body the time to repair and rebuild damaged muscle tissue is key for healthy growth and to avoid training under adverse conditions.
es: Si experimentas dolores musculares intensos (agujetas), toma el descanso necesario hasta recuperarte por completo. Permitir que el cuerpo repare y reconstruya los tejidos musculares dañados es esencial para un crecimiento saludable y evitar entrenar bajo condiciones desfavorables.

# gymTips7
source: Remember that proper technique is crucial when lifting weights. Focus on controlling the negative phase of each repetition by lowering the weight slowly and steadily. This maximizes muscle activation, reduces the risk of injury, and helps you progress safely and effectively.
es: Recuerda que la correcta ejecución de la técnica es esencial en el entrenamiento con pesas. Enfócate en controlar la fase negativa de cada repetición, bajando el peso de forma lenta y sostenida. Esto maximiza la activación de los músculos, disminuye el riesgo de lesiones y te ayuda a progresar de manera segura y efectiva.

# infoRutinas
source: You have 2 types of routines available, for training at the gym or at home
es: Tienes a tu disposicion 2 tipos de rutina, para entreno en gimnasio o en casa.

# noGymTips1
source: During your home workouts, we recommend taking rest periods of 1 to 2 minutes between sets, as resources may be limited and intensity levels can vary.
es: Durante tus entrenamientos en casa, te recomendamos mantener periodos de descanso de entre 1 y 2 minutos entre series, ya que los recursos suelen ser limitados y la intensidad puede variar.

# noGymTips2
source: Remember that home training focuses on functional routines and calisthenics, emphasizing weight loss and muscle toning rather than hypertrophy; adjust your sets according to your level.
es: Recuerda que entrenar en casa se centra en rutinas funcionales y de calistenia, con un enfoque en la pérdida de peso y la tonificación muscular, en lugar de la hipertrofia; por ello, adapta tus series a tu nivel.

# noGymTips3
source: It is not necessary to replicate the intensities found in a gym; take advantage of your body weight or available home equipment to work out in a balanced and safe manner.
es: No es necesario replicar las intensidades de un gimnasio; aprovecha tu peso corporal o el equipamiento casero disponible para trabajar de forma equilibrada y segura.

# noGymTips4
source: Even though home workouts are more accessible, it is recommended to have at least 2 rest days per week to allow your muscles to recover properly.
es: Aunque entrenar en casa es más accesible, se recomienda disponer de al menos 2 días de descanso a la semana para permitir que tus músculos se recuperen adecuadamente.

# noGymTips5
source: After your home workout, consider consuming a fast-absorbing protein source, such as a simple protein shake, to promote recovery without a high caloric intake.
es: Después del entrenamiento en casa, considera consumir una fuente de proteínas de rápida absorción, como un batido de proteína simple, para favorecer la recuperación sin un aporte calórico elevado.

# noGymTips6
source: If you experience intense discomfort or pain, it is essential to rest and adjust your home workout intensity to prevent injuries and ensure optimal recovery.
es: Si sientes molestias o dolores intensos, es esencial descansar y ajustar la intensidad de tus rutinas en casa para prevenir lesiones y asegurar una recuperación óptima.

# noGymTips7
source: Maintain a constant and intense pace during your home workouts. Try to keep breaks as brief as possible without compromising proper technique, maximizing calorie burn and workout efficiency.
es: Mantén un ritmo constante e intenso durante tus ejercicios en casa. Intenta hacer descansos lo más breves posible sin comprometer la técnica, para maximizar el gasto calórico y la eficacia del entrenamiento.

# noGymTips8
source: Plan and structure your routines to optimize results. Pay close attention to the correct execution of each movement, maintain controlled breathing, and use resources that help you stay motivated.
es: Planifica y estructura tus rutinas para optimizar los resultados. Presta especial atención a la ejecución correcta de cada movimiento, controlando la respiración y utilizando recursos que te ayuden a mantener la motivación.

# noGymTips9
source: Perform a proper warm-up and cool-down routine before and after your workouts. Include joint mobility exercises and dynamic stretches to prepare your muscles and prevent injuries.
es: Realiza una rutina de calentamiento y enfriamiento adecuada antes y después de tus entrenamientos. Incluye movilidad articular y estiramientos dinámicos para preparar tus músculos y prevenir lesiones.

# noGymTips12
source: Set personal goals and track your progress to keep yourself motivated and adjust the intensity of your home workouts as needed.
es: Establece metas personales y lleva un registro de tus progresos para mantener tu motivación y ajustar la intensidad de tus entrenamientos en casa según tus necesidades.

# accountDeleting
source: Your account is being deleted...
es: Tu cuenta se está eliminando...

# accountDeletedDialogTitle
source: Account successfully deleted
es: Cuenta eliminada correctamente

# accountDeletedDialogMessage
source: Your account and all your data have been successfully deleted. Thank you for using Fit Leage, see you soon!
es: Tu cuenta y todos tus datos han sido eliminados correctamente. Gracias por usar Fit Leage, ¡hasta pronto!

# enterPasswordToDelete
source: Enter your password to delete your account and all your data
es: Ingresa tu contraseña para eliminar la cuenta y todos tus datos

# forgotPassword
source: Forgot your password?
es: ¿Has olvidado tu contraseña?

source: Days until {percent}%
es: Días hasta {percent}%

# removeAdsTitle
source: Membership
es: Membresía

# alreadySubscribedMessage
source: Thanks for subscribing to Fit League!
es: ¡Gracias por suscribirte a Fit League!

# restorePurchasesButton
source: Restore Membership
es: Restaurar membresía

# menuMembership
source: Membership
es: Membresía

# menuSubscribeOption
source: BECOME A MEMBER
es: HAZTE MIEMBRO

# monthlyPlanName
source: Monthly Subscription
es: Suscripción Mensual

# monthlyPlanDesc
source: Enjoy a completely ad-free experience for 30 days
es: Disfruta de una experiencia totalmente limpia durante 30 días

# monthlyBenefit1
source: Faster loading
es: Carga más rápida

# monthlyBenefit2
source: No ad interruptions
es: Sin interrupciones publicitarias

# monthlyBenefit3
source: 24-hour customer support
es: Atención al cliente 24 h

# monthlyBenefit4
source: Cancel anytime
es: Date de baja en cualquier momento

# annualPlanName
source: Annual Subscription
es: Suscripción Anual

# annualPlanDesc
source: Remove all ads for 1 year (save 44%)
es: Elimina todos los anuncios durante 1 año (ahorro del 44%)

# annualBenefit1
source: No ads for 12 months
es: Sin anuncios durante 12 meses

# annualBenefit2
source: Save 44%
es: Ahorro del 44%

# annualBenefit3
source: Priority access to new features
es: Acceso prioritario a nuevas funciones

# annualBenefit4
source: 24-hour customer support
es: Atención al cliente 24 h
